20250503T075205--kdoc-363-リリース番号のrcはリリース候補を示す__permanent.org
:properties:
:ID: 20250503T075205
:mtime:    20250903203700
:ctime:    20250503075210
:end:
#+title:      KDOC 363: リリース番号のrcはリリース候補を示す
#+date:       [2025-05-03 Sat 07:52]
#+filetags:   :permanent:
#+identifier: 20250503T075205

* この文書のステータス
- 作成
  - [X] 2025-05-07 貴島
- レビュー
  - [X] 2025-05-07 貴島

* 概要

[[https://go.dev/doc/toolchain#version][Go Versions]]によると、 ~1.21rc2~ のようなGoのバージョンは、Release Candidateであり、リリース候補を示す。リリースされたら ~1.21.4~ のようになる。ほかのアプリケーションでも見かける表記だが、あまり考えてこなかった。

#+caption: Go version(1.21より後)
#+begin_src code
1.21 < 1.21rc1 < 1.21rc2 < 1.21.0 < 1.21.1 < 1.21.2
#+end_src

1.21がリリース候補より前、という意味になるのは落とし穴に見える。

* 関連

- [[id:20250502T001229][KDOC 360: goとtoolchainの違いは何か?]]。を調べる途中で見つけた
