20250503T075205--kdoc-363-リリース番号のrcはリリース候補を示す__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:11:50Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 363: リリース番号のrcはリリース候補を示す</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 363: リリース番号のrcはリリース候補を示す</h1>
<div id="outline-container-org2161df9" class="outline-2">
<h2 id="org2161df9"><a href="#org2161df9">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2161df9">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-07 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-05-07 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org55240dc" class="outline-2">
<h2 id="org55240dc"><a href="#org55240dc">概要</a></h2>
<div class="outline-text-2" id="text-org55240dc">
<p>
<a href="https://go.dev/doc/toolchain#version">Go Versions</a>によると、 <code>1.21rc2</code> のようなGoのバージョンは、Release Candidateであり、リリース候補を示す。リリースされたら <code>1.21.4</code> のようになる。ほかのアプリケーションでも見かける表記だが、あまり考えてこなかった。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Go version(1.21より後)</label><pre class="src src-code">1.21 &lt; 1.21rc1 &lt; 1.21rc2 &lt; 1.21.0 &lt; 1.21.1 &lt; 1.21.2
</pre>
</div>

<p>
1.21がリリース候補より前、という意味になるのは落とし穴に見える。
</p>
</div>
</div>
<div id="outline-container-org879cf0c" class="outline-2">
<h2 id="org879cf0c"><a href="#org879cf0c">関連</a></h2>
<div class="outline-text-2" id="text-org879cf0c">
<ul class="org-ul">
<li><a href="20250502T001229--kdoc-360-goとtoolchainの違いは何か__permanent.html#ID-20250502T001229">KDOC 360: goとtoolchainの違いは何か?</a>。を調べる途中で見つけた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
